docs/book-notes/EOPL/NAMELESS/NAMELESS.org
#+html_head: <link rel="stylesheet" href="../../../css/org-page.css"/>
#+property: tangle NAMELESS.jo
#+title: NAMELESS

* intro

  - We now implement the lexical-address analysis.
    We write a procedure 'tran'
    that takes a exp
    and removes all the variables from the declarations,
    and replaces every variable reference by its lexical depth.

  - For example, the program :

  #+begin_src jojo
  (note
    (let :x 37
      (proc :y
        (let :z (diff :y :x)
          (diff :x :y)))))
  #+end_src

  - will be translated to :

  #+begin_src jojo
  (note
    (let-nameless 37
      (proc-nameless
        (let-nameless (diff (var-nameless 0) (var-nameless 1))
          (diff (var-nameless 2) (var-nameless 1))))))
  #+end_src

  - We then write a new version of 'program-eval'
    that will find the value of such a nameless program,
    without putting variables in the environment.

* the translator

  - We are writing a translator,
    so we need to know the source language and the target language.

  - the source language is the exp of PROC.

  - the target language is called nameless-exp,
    which add some new exp constructors to it,
    and remove some old exp constructors.

* exp

  #+begin_src jojo
  (note program = exp)

  (note exp
    = <const-exp> -- 123
    | <zero?-exp> -- (diff ... ...)
    | <if-exp>    -- (if ... ... ...)
    | <diff-exp>  -- (zero? ...)

    | <var-exp>   -- :var
    | <let-exp>   -- (let :var ... ...)
    | <proc-exp>  -- (proc :var ...)

    | <call-exp>  -- (call ... ...))

  (+data <const-exp> .num)
  (+data <zero?-exp> .exp1)
  (+data <if-exp>    .exp1 .exp2 .exp3)
  (+data <diff-exp>  .exp1 .exp2)
  (+data <var-exp>   .var)
  (+data <let-exp>   .var .exp1 .body)

  (+data <proc-exp>  .var .body)
  (+data <call-exp>  .rator .rand)
  #+end_src

