docs/book-notes/EOPL/NAMELESS/NAMELESS.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-10-15 Sun 21:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NAMELESS</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="xieyuheng" />
<link rel="stylesheet" href="../../../css/org-page.css"/>
</head>
<body>
<div id="content">
<h1 class="title">NAMELESS</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf2b9757">intro</a></li>
<li><a href="#org5d78cc1">the translator</a></li>
<li><a href="#orgce41d2d">exp</a></li>
<li><a href="#org84dd108">nameless-exp</a></li>
<li><a href="#orgda6b41">static-env</a>
<ul>
<li><a href="#org8807dc3"><span class="todo _note_">[note]</span> </a></li>
<li><a href="#org5885660">static-env</a></li>
<li><a href="#org59f1cc5">static-env-apply</a></li>
</ul>
</li>
<li><a href="#orge7ff83a">tran</a></li>
<li><a href="#orga9e5a46">nameless-env</a>
<ul>
<li><a href="#orgc155d06"><span class="todo _note_">[note]</span> </a></li>
<li><a href="#orgd001b22">nameless-env</a></li>
<li><a href="#orgcd37e16">nameless-env-apply</a></li>
</ul>
</li>
<li><a href="#orgdc65b2d">expval</a></li>
<li><a href="#orgb897624">proc</a></li>
<li><a href="#org197532f">eval</a></li>
<li><a href="#org9cf1bb3">program</a></li>
<li><a href="#org89e55e">parse</a></li>
<li><a href="#org4bf5bb7">interface</a></li>
<li><a href="#orgf03a4d4"><span class="done _test_">[test]</span> </a></li>
<li><a href="#org59f458a">exercise</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf2b9757" class="outline-2">
<h2 id="orgf2b9757">intro</h2>
<div class="outline-text-2" id="text-orgf2b9757">
<ul class="org-ul">
<li><p>We now implement the lexical-address analysis.</p><p>We write a procedure 'tran'</p><p>that takes a exp</p><p>and removes all the variables from the declarations,</p><p>and replaces every variable reference by its lexical depth.</p></li>

<li><p>For example, the program :</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">let</span> <span style="color: #a6e22e;">:x</span> <span style="color: #ae81ff;">37</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">proc</span> <span style="color: #a6e22e;">:y</span>
      <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">let</span> <span style="color: #a6e22e;">:z</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #a6e22e;">:x</span><span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span><span style="color: #696969;">)))))</span>
</pre>
</div>

<ul class="org-ul">
<li><p>will be translated to :</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span>let-nameless <span style="color: #ae81ff;">37</span>
    <span style="color: #696969;">(</span>proc-nameless
      <span style="color: #696969;">(</span>let-nameless <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #696969;">(</span>var-nameless <span style="color: #ae81ff;">0</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>var-nameless <span style="color: #ae81ff;">1</span><span style="color: #696969;">))</span>
        <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #696969;">(</span>var-nameless <span style="color: #ae81ff;">2</span><span style="color: #696969;">)</span> <span style="color: #696969;">(</span>var-nameless <span style="color: #ae81ff;">1</span><span style="color: #696969;">))))))</span>
</pre>
</div>

<ul class="org-ul">
<li><p>We then write a new version of 'program-eval'</p><p>that will find the value of such a nameless program,</p><p>without putting variables in the environment.</p></li></ul>
</div>
</div>

<div id="outline-container-org5d78cc1" class="outline-2">
<h2 id="org5d78cc1">the translator</h2>
<div class="outline-text-2" id="text-org5d78cc1">
<ul class="org-ul">
<li><p>We are writing a translator,</p><p>so we need to know the source language and the target language.</p></li>

<li><p>the source language is the exp of PROC.</p></li>

<li><p>the target language is called nameless-exp,</p><p>which add some new exp constructors to it,</p><p>and remove some old exp constructors.</p></li></ul>
</div>
</div>

<div id="outline-container-orgce41d2d" class="outline-2">
<h2 id="orgce41d2d">exp</h2>
<div class="outline-text-2" id="text-orgce41d2d">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> program = exp<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> exp
  = <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #ae81ff;">123</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span>zero? <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span>

  | <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #a6e22e;">:var</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>   <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">let</span> <span style="color: #a6e22e;">:var</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;proc-exp&gt;</span>  <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">proc</span> <span style="color: #a6e22e;">:var</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span>

  | <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span>  <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">call</span> <span style="color: #ae81ff;">...</span> ...<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> .num<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> .exp1<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #ae81ff;">.exp1</span> <span style="color: #ae81ff;">.exp2</span> .exp3<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #ae81ff;">.exp1</span> .exp2<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>   .var<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>   <span style="color: #ae81ff;">.var</span> <span style="color: #ae81ff;">.exp1</span> .body<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc-exp&gt;</span>  <span style="color: #ae81ff;">.var</span> .body<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span>  <span style="color: #ae81ff;">.rator</span> <span style="color: #ae81ff;">.rand</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
