docs/book-notes/EOPL/NAMELESS/NAMELESS.org
* nameless-exp

  #+begin_src jojo
  (note nameless-exp
    = <const-exp> -- 123
    | <zero?-exp> -- (diff ... ...)
    | <if-exp>    -- (if ... ... ...)
    | <diff-exp>  -- (zero? ...)

    | <call-exp>  -- (call ... ...)

    | <var-nameless-exp> -- (var-nameless :n)
    | <let-nameless-exp> -- (let-nameless ... ...)
    | <proc-nameless-exp> -- (proc-nameless ...))

  (+data <var-nameless-exp> .num)
  (+data <let-nameless-exp> .exp1 .body)
  (+data <proc-nameless-exp> .body)
  #+end_src

* static-env

*** [note]

    - To calculate the lexical address of any variable reference,
      we need to know the scopes in which it is enclosed.

    - This is context information
      is passed as auxiliary argument,
      called static environment.

    - The static environment will be a list of variables,
      representing the scopes within which
      the current expression lies.

    - The variable declared in the innermost scope
      will be the first element of the list.

    - when we translate the last line of the example :

    #+begin_src jojo
    (note
      (let :x 37
        (proc :y
          (let :z (diff :y :x)
            (diff :x :y)))))
    #+end_src

    - the static environment should be :
      (:z :y :x)

    - So looking up a variable in the static environment
      means finding its position in the static environment,
      which gives a lexical address.

    - looking up :x will give 2,
      looking up :y will give 1,
      looking up :z will give 0.

*** static-env

    #+begin_src jojo
    (+data <null-static-env>)
    (+data <cons-static-env> .rest .var)
    #+end_src

*** static-env-apply

    #+begin_src jojo
    (+jojo static-env-apply
      (-> :var :static-env -- lexical-address)
      (case :static-env

        <null-static-env>
        ["- static-env-apply fail" p nl
         "  can not find var : " p :var p nl
         error]

        <cons-static-env>
        (if [:static-env .var :var equal?]
          0
          [:var :static-env .rest static-env-apply inc])))
    #+end_src

