docs/book-notes/EOPL/NAMELESS/NAMELESS.html

<div id="outline-container-org84dd108" class="outline-2">
<h2 id="org84dd108">nameless-exp</h2>
<div class="outline-text-2" id="text-org84dd108">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> nameless-exp
  = <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #ae81ff;">123</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span>zero? <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span>

  | <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span>  <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">call</span> <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span>

  | <span style="color: #66d9ef; font-weight: bold;">&lt;var-nameless-exp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span>var-nameless <span style="color: #a6e22e;">:n</span><span style="color: #696969;">)</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;let-nameless-exp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span>let-nameless <span style="color: #ae81ff;">...</span> <span style="color: #ae81ff;">...</span><span style="color: #696969;">)</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;proc-nameless-exp&gt;</span> <span style="color: #66d9ef; font-weight: bold;">--</span> <span style="color: #696969;">(</span>proc-nameless ...<span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;var-nameless-exp&gt;</span> .num<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;let-nameless-exp&gt;</span> <span style="color: #ae81ff;">.exp1</span> .body<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc-nameless-exp&gt;</span> <span style="color: #ae81ff;">.body</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda6b41" class="outline-2">
<h2 id="orgda6b41">static-env</h2>
<div class="outline-text-2" id="text-orgda6b41">
</div><div id="outline-container-org8807dc3" class="outline-3">
<h3 id="org8807dc3"><span class="todo _note_">[note]</span> </h3>
<div class="outline-text-3" id="text-org8807dc3">
<ul class="org-ul">
<li><p>To calculate the lexical address of any variable reference,</p><p>we need to know the scopes in which it is enclosed.</p></li>

<li><p>This is context information</p><p>is passed as auxiliary argument,</p><p>called static environment.</p></li>

<li><p>The static environment will be a list of variables,</p><p>representing the scopes within which</p><p>the current expression lies.</p></li>

<li><p>The variable declared in the innermost scope</p><p>will be the first element of the list.</p></li>

<li><p>when we translate the last line of the example :</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">let</span> <span style="color: #a6e22e;">:x</span> <span style="color: #ae81ff;">37</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">proc</span> <span style="color: #a6e22e;">:y</span>
      <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">let</span> <span style="color: #a6e22e;">:z</span> <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:y</span> <span style="color: #a6e22e;">:x</span><span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">diff</span> <span style="color: #a6e22e;">:x</span> <span style="color: #a6e22e;">:y</span><span style="color: #696969;">)))))</span>
</pre>
</div>

<ul class="org-ul">
<li><p>the static environment should be :</p><p>(:z :y :x)</p></li>

<li><p>So looking up a variable in the static environment</p><p>means finding its position in the static environment,</p><p>which gives a lexical address.</p></li>

<li><p>looking up :x will give 2,</p><p>looking up :y will give 1,</p><p>looking up :z will give 0.</p></li></ul>
</div>
</div>

<div id="outline-container-org5885660" class="outline-3">
<h3 id="org5885660">static-env</h3>
<div class="outline-text-3" id="text-org5885660">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;null-static-env&gt;</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;cons-static-env&gt;</span> <span style="color: #ae81ff;">.rest</span> <span style="color: #ae81ff;">.var</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org59f1cc5" class="outline-3">
<h3 id="org59f1cc5">static-env-apply</h3>
<div class="outline-text-3" id="text-org59f1cc5">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> static-env-apply
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:static-env</span> <span style="color: #66d9ef; font-weight: bold;">--</span> lexical-address<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:static-env</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;null-static-env&gt;</span>
    <span style="color: #797979;">[</span><span style="color: #e6db74;">"- static-env-apply fail"</span> p nl
     <span style="color: #e6db74;">"  can not find var : "</span> p <span style="color: #a6e22e;">:var</span> p nl
     <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;cons-static-env&gt;</span>
    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:static-env</span> <span style="color: #ae81ff;">.var</span> <span style="color: #a6e22e;">:var</span> equal?<span style="color: #797979;">]</span>
      <span style="color: #ae81ff;">0</span>
      <span style="color: #797979;">[</span><span style="color: #a6e22e;">:var</span> <span style="color: #a6e22e;">:static-env</span> <span style="color: #ae81ff;">.rest</span> static-env-apply inc<span style="color: #797979;">]</span><span style="color: #696969;">)))</span>
</pre>
</div>
</div>
</div>
</div>
