docs/book-notes/EOPL/NAMELESS/NAMELESS.org
* tran

  - We are trying to translate an expression
    which is sitting inside the declarations
    represented by static-env.

  - To do this, we recursively copy the tree,
    while :

    1. <var-exp> -> <var-nameless-exp>
       with the right lexical address,
       which we compute by calling apply-senv.

    2. <let-exp> -> <let-nameless-exp>
       the body with be translated in extended static-env.

    3. <proc-exp> -> <proc-nameless-exp>
       the body with be translated in extended static-env.

  #+begin_src jojo
  (+jojo tran (-> :exp :static-env -- nameless-exp)
    (case :exp
      <const-exp> :exp
      <zero?-exp> [:exp .exp1 :static-env tran zero?-exp]
      <if-exp>    [:exp .exp1 :static-env tran
                   :exp .exp2 :static-env tran
                   :exp .exp3 :static-env tran if-exp]
      <diff-exp>  [:exp .exp1 :static-env tran
                   :exp .exp2 :static-env tran diff-exp]
      <call-exp>  [:exp .rator :static-env tran
                   :exp .rand  :static-env tran call-exp]

      <var-exp>   [:exp .var
                   :static-env static-env-apply
                   var-nameless-exp]
      <let-exp>   [:static-env, :exp .var, cons-static-env
                   :new-static-env!
                   :exp .exp1 :static-env tran
                   :exp .body :new-static-env tran
                   let-nameless-exp]
      <proc-exp>  [:static-env, :exp .var, cons-static-env
                   :new-static-env!
                   :exp .body :new-static-env tran
                   proc-nameless-exp]))
  #+end_src

* nameless-env

*** [note]

    - our interpreter takes advantage of the predictions
      of the lexical-address analyzer
      to avoid explicitly searching for variables at run time.

    - since there are no more variables in our programs,
      we won’t be able to put variables in our environments,
      but since we know exactly where to look in each environment,
      we don’t need them!

    - at run time,
      instead of having full-fledged environments,
      we will have nameless environments.

*** nameless-env

    #+begin_src jojo
    (+data <null-nameless-env>)
    (+data <cons-nameless-env> .rest .val)
    #+end_src

*** nameless-env-apply

    #+begin_src jojo
    (+jojo nameless-env-apply
      (-> :lexical-address :nameless-env -- denval)
      (cond [:nameless-env null-nameless-env?]
            ["- nameless-env-apply fail" p nl
             "  lexical-address greater then" p nl
             "  length of nameless-env" p nl
             error]
            [:lexical-address 0 eq?] [:nameless-env .val]
            else [:lexical-address dec
                  :nameless-env .rest nameless-env-apply]))
    #+end_src

* expval

  #+begin_src jojo
  (note denval = expval)

  (note expval
    = <num-val>
    | <bool-val>
    | <proc-val>)

  (+data <num-val>  .num)
  (+data <bool-val> .bool)

  (+data <proc-val> .proc)
  #+end_src

* proc

  - The revised specification for procedures
    is just the old one with the variable name removed.

  #+begin_src jojo
  (+data <proc> .body .saved-env)

  (+jojo proc-apply (-> :val :proc -- expval)
    :proc .saved-env :val cons-nameless-env
    :proc .body swap eval)
  #+end_src

