docs/book-notes/EOPL/NAMELESS/NAMELESS.html

<div id="outline-container-orge7ff83a" class="outline-2">
<h2 id="orge7ff83a">tran</h2>
<div class="outline-text-2" id="text-orge7ff83a">
<ul class="org-ul">
<li><p>We are trying to translate an expression</p><p>which is sitting inside the declarations</p><p>represented by static-env.</p></li>

<li><p>To do this, we recursively copy the tree,</p><p>while :</p><p></p><p><ol class="org-ol"></p><p><li>&lt;var-exp&gt; -&gt; &lt;var-nameless-exp&gt;</p><p>with the right lexical address,</p><p>which we compute by calling apply-senv.</li></p><p></p><p><li>&lt;let-exp&gt; -&gt; &lt;let-nameless-exp&gt;</p><p>the body with be translated in extended static-env.</li></p><p></p><p><li>&lt;proc-exp&gt; -&gt; &lt;proc-nameless-exp&gt;</p><p>the body with be translated in extended static-env.</li></ol></p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> tran <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #a6e22e;">:static-env</span> <span style="color: #66d9ef; font-weight: bold;">--</span> nameless-exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:exp</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> <span style="color: #a6e22e;">:exp</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:static-env</span> tran zero?-exp<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:static-env</span> tran
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #a6e22e;">:static-env</span> tran
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp3</span> <span style="color: #a6e22e;">:static-env</span> tran if-exp<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:static-env</span> tran
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #a6e22e;">:static-env</span> tran diff-exp<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.rator</span> <span style="color: #a6e22e;">:static-env</span> tran
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.rand</span>  <span style="color: #a6e22e;">:static-env</span> tran call-exp<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;var-exp&gt;</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.var</span>
                 <span style="color: #a6e22e;">:static-env</span> static-env-apply
                 var-nameless-exp<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;let-exp&gt;</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:static-env</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.var</span><span style="color: #f92672; font-weight: bold;">,</span> cons-static-env
                 <span style="color: #fd971f;">:new-static-env!</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:static-env</span> tran
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.body</span> <span style="color: #a6e22e;">:new-static-env</span> tran
                 let-nameless-exp<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;proc-exp&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:static-env</span><span style="color: #f92672; font-weight: bold;">,</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.var</span><span style="color: #f92672; font-weight: bold;">,</span> cons-static-env
                 <span style="color: #fd971f;">:new-static-env!</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.body</span> <span style="color: #a6e22e;">:new-static-env</span> tran
                 proc-nameless-exp<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga9e5a46" class="outline-2">
<h2 id="orga9e5a46">nameless-env</h2>
<div class="outline-text-2" id="text-orga9e5a46">
</div><div id="outline-container-orgc155d06" class="outline-3">
<h3 id="orgc155d06"><span class="todo _note_">[note]</span> </h3>
<div class="outline-text-3" id="text-orgc155d06">
<ul class="org-ul">
<li><p>our interpreter takes advantage of the predictions</p><p>of the lexical-address analyzer</p><p>to avoid explicitly searching for variables at run time.</p></li>

<li><p>since there are no more variables in our programs,</p><p>we won’t be able to put variables in our environments,</p><p>but since we know exactly where to look in each environment,</p><p>we don’t need them!</p></li>

<li><p>at run time,</p><p>instead of having full-fledged environments,</p><p>we will have nameless environments.</p></li></ul>
</div>
</div>

<div id="outline-container-orgd001b22" class="outline-3">
<h3 id="orgd001b22">nameless-env</h3>
<div class="outline-text-3" id="text-orgd001b22">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;null-nameless-env&gt;</span><span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;cons-nameless-env&gt;</span> <span style="color: #ae81ff;">.rest</span> <span style="color: #ae81ff;">.val</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgcd37e16" class="outline-3">
<h3 id="orgcd37e16">nameless-env-apply</h3>
<div class="outline-text-3" id="text-orgcd37e16">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> nameless-env-apply
  <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:lexical-address</span> <span style="color: #a6e22e;">:nameless-env</span> <span style="color: #66d9ef; font-weight: bold;">--</span> denval<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:nameless-env</span> null-nameless-env?<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #e6db74;">"- nameless-env-apply fail"</span> p nl
         <span style="color: #e6db74;">"  lexical-address greater then"</span> p nl
         <span style="color: #e6db74;">"  length of nameless-env"</span> p nl
         <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:lexical-address</span> <span style="color: #ae81ff;">0</span> eq?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:nameless-env</span> <span style="color: #ae81ff;">.val</span><span style="color: #797979;">]</span>
        <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:lexical-address</span> dec
              <span style="color: #a6e22e;">:nameless-env</span> <span style="color: #ae81ff;">.rest</span> nameless-env-apply<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgdc65b2d" class="outline-2">
<h2 id="orgdc65b2d">expval</h2>
<div class="outline-text-2" id="text-orgdc65b2d">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> denval = expval<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">note</span> expval
  = <span style="color: #66d9ef; font-weight: bold;">&lt;num-val&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;bool-val&gt;</span>
  | <span style="color: #66d9ef; font-weight: bold;">&lt;proc-val&gt;</span><span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;num-val&gt;</span>  .num<span style="color: #696969;">)</span>
<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;bool-val&gt;</span> .bool<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc-val&gt;</span> <span style="color: #ae81ff;">.proc</span><span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb897624" class="outline-2">
<h2 id="orgb897624">proc</h2>
<div class="outline-text-2" id="text-orgb897624">
<ul class="org-ul">
<li><p>The revised specification for procedures</p><p>is just the old one with the variable name removed.</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+data</span> <span style="color: #66d9ef; font-weight: bold;">&lt;proc&gt;</span> <span style="color: #ae81ff;">.body</span> .saved-env<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> proc-apply <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:val</span> <span style="color: #a6e22e;">:proc</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:proc</span> <span style="color: #ae81ff;">.saved-env</span> <span style="color: #a6e22e;">:val</span> cons-nameless-env
  <span style="color: #a6e22e;">:proc</span> <span style="color: #ae81ff;">.body</span> swap eval<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
