docs/book-notes/EOPL/NAMELESS/NAMELESS.org
* eval

  - now
    :exp is nameless-exp
    :env is nameless-env

  #+begin_src jojo
  (+jojo eval (-> :exp :env -- expval)
    (case :exp
      <const-exp> [:exp .num num-val]
      <zero?-exp> [:exp .exp1 :env eval .num 0 equal? bool-val]
      <if-exp>    (if [:exp .exp1 :env eval .bool]
                      [:exp .exp2 :env eval]
                      [:exp .exp3 :env eval])
      <diff-exp>  [:exp .exp1 :env eval .num
                   :exp .exp2 :env eval .num sub num-val]
      <call-exp>  [:exp .rator :env eval .proc :proc!
                   :exp .rand  :env eval :arg!
                   :arg :proc proc-apply]

      <var-nameless-exp> [:exp .num :env nameless-env-apply]
      <let-nameless-exp> [:env
                          :exp .exp1 :env eval
                          cons-nameless-env :new-env!
                          :exp .body :new-env eval]
      <proc-nameless-exp> [:exp .body :env proc proc-val]))
  #+end_src

* program

  #+begin_src jojo
  (+jojo init-static-env
    null-static-env
    ':x cons-static-env
    ':v cons-static-env
    ':i cons-static-env)

  (+jojo init-nameless-env
    null-nameless-env
    10 num-val cons-nameless-env
    5  num-val cons-nameless-env
    1  num-val cons-nameless-env)

  (+jojo program-eval (-> :program -- expval)
    :program init-nameless-env eval)
  #+end_src

* parse

  #+begin_src jojo
  (+jojo parse (-> :sexp -- exp)
    (cond
      [:sexp string?] [:sexp parse/string]
      [:sexp cons?] [:sexp parse/cons]
      else  ["- parse fail" p nl
             "  can not parse sexp : " p
             :sexp sexp-print nl
             error]))

  (+jojo parse/string (-> :string -- exp)
    (cond
      [:string int-string?]   [:string string->int const-exp]
      [:string local-string?] [:string var-exp]
      else ["- parse/string fail" p nl
            "  can not parse string : " p :string p nl
            error]))

  (+jojo parse/cons (-> :sexp -- exp)
    :sexp .car :key!
    :sexp .cdr :body!
    (cond [:key 'zero? eq?] [:body parse/spread zero?-exp]
          [:key 'if eq?]    [:body parse/spread if-exp]
          [:key 'diff eq?]  [:body parse/spread diff-exp]
          [:key 'let eq?]   [:body .car :body
                             .cdr parse/spread let-exp]

          [:key 'proc eq?]  [:body .car :body
                             .cdr parse/spread proc-exp]
          [:key 'call eq?]  [:body parse/spread call-exp]))

  (+jojo parse/spread {parse} list-map list-spread)
  #+end_src

