docs/book-notes/EOPL/NAMELESS/NAMELESS.html

<div id="outline-container-org197532f" class="outline-2">
<h2 id="org197532f">eval</h2>
<div class="outline-text-2" id="text-org197532f">
<ul class="org-ul">
<li><p>now</p><p>:exp is nameless-exp</p><p>:env is nameless-env</p></li></ul>

<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> eval <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:exp</span> <span style="color: #a6e22e;">:env</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #a6e22e;">:exp</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;const-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.num</span> num-val<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;zero?-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.num</span> <span style="color: #ae81ff;">0</span> equal? bool-val<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;if-exp&gt;</span>    <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">if</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.bool</span><span style="color: #797979;">]</span>
                    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span>
                    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp3</span> <span style="color: #a6e22e;">:env</span> eval<span style="color: #797979;">]</span><span style="color: #696969;">)</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;diff-exp&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.num</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp2</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.num</span> sub num-val<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;call-exp&gt;</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.rator</span> <span style="color: #a6e22e;">:env</span> eval <span style="color: #ae81ff;">.proc</span> <span style="color: #fd971f;">:proc!</span>
                 <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.rand</span>  <span style="color: #a6e22e;">:env</span> eval <span style="color: #fd971f;">:arg!</span>
                 <span style="color: #a6e22e;">:arg</span> <span style="color: #a6e22e;">:proc</span> proc-apply<span style="color: #797979;">]</span>

    <span style="color: #66d9ef; font-weight: bold;">&lt;var-nameless-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.num</span> <span style="color: #a6e22e;">:env</span> nameless-env-apply<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;let-nameless-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:env</span>
                        <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.exp1</span> <span style="color: #a6e22e;">:env</span> eval
                        cons-nameless-env <span style="color: #fd971f;">:new-env!</span>
                        <span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.body</span> <span style="color: #a6e22e;">:new-env</span> eval<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">&lt;proc-nameless-exp&gt;</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:exp</span> <span style="color: #ae81ff;">.body</span> <span style="color: #a6e22e;">:env</span> proc proc-val<span style="color: #797979;">]</span><span style="color: #696969;">))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9cf1bb3" class="outline-2">
<h2 id="org9cf1bb3">program</h2>
<div class="outline-text-2" id="text-org9cf1bb3">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> init-static-env
  null-static-env
  '<span style="color: #a6e22e;">:x</span> cons-static-env
  '<span style="color: #a6e22e;">:v</span> cons-static-env
  '<span style="color: #a6e22e;">:i</span> cons-static-env<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> init-nameless-env
  null-nameless-env
  <span style="color: #ae81ff;">10</span> num-val cons-nameless-env
  <span style="color: #ae81ff;">5</span>  num-val cons-nameless-env
  <span style="color: #ae81ff;">1</span>  num-val cons-nameless-env<span style="color: #696969;">)</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> program-eval <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:program</span> <span style="color: #66d9ef; font-weight: bold;">--</span> expval<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:program</span> init-nameless-env eval<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org89e55e" class="outline-2">
<h2 id="org89e55e">parse</h2>
<div class="outline-text-2" id="text-org89e55e">
<div class="org-src-container">

<pre class="src src-jojo"><span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:sexp</span> <span style="color: #66d9ef; font-weight: bold;">--</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> string?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> parse/string<span style="color: #797979;">]</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> cons?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:sexp</span> parse/cons<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">else</span>  <span style="color: #797979;">[</span><span style="color: #e6db74;">"- parse fail"</span> p nl
           <span style="color: #e6db74;">"  can not parse sexp : "</span> p
           <span style="color: #a6e22e;">:sexp</span> sexp-print nl
           <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse/string <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:string</span> <span style="color: #66d9ef; font-weight: bold;">--</span> exp<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:string</span> int-string?<span style="color: #797979;">]</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:string</span> string-&gt;int const-exp<span style="color: #797979;">]</span>
    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:string</span> local-string?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:string</span> var-exp<span style="color: #797979;">]</span>
    <span style="color: #66d9ef; font-weight: bold;">else</span> <span style="color: #797979;">[</span><span style="color: #e6db74;">"- parse/string fail"</span> p nl
          <span style="color: #e6db74;">"  can not parse string : "</span> p <span style="color: #a6e22e;">:string</span> p nl
          <span style="color: #f92672; font-weight: bold;">error</span><span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse/cons <span style="color: #696969;">(</span><span style="color: #66d9ef; font-weight: bold;">-&gt;</span> <span style="color: #a6e22e;">:sexp</span> <span style="color: #66d9ef; font-weight: bold;">--</span> exp<span style="color: #696969;">)</span>
  <span style="color: #a6e22e;">:sexp</span> <span style="color: #ae81ff;">.car</span> <span style="color: #fd971f;">:key!</span>
  <span style="color: #a6e22e;">:sexp</span> <span style="color: #ae81ff;">.cdr</span> <span style="color: #fd971f;">:body!</span>
  <span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">cond</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'zero? eq?<span style="color: #797979;">]</span> <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread zero?-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'if eq?<span style="color: #797979;">]</span>    <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread if-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'diff eq?<span style="color: #797979;">]</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread diff-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'let eq?<span style="color: #797979;">]</span>   <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:body</span>
                           <span style="color: #ae81ff;">.cdr</span> parse/spread let-exp<span style="color: #797979;">]</span>

        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'proc eq?<span style="color: #797979;">]</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> <span style="color: #ae81ff;">.car</span> <span style="color: #a6e22e;">:body</span>
                           <span style="color: #ae81ff;">.cdr</span> parse/spread proc-exp<span style="color: #797979;">]</span>
        <span style="color: #797979;">[</span><span style="color: #a6e22e;">:key</span> 'call eq?<span style="color: #797979;">]</span>  <span style="color: #797979;">[</span><span style="color: #a6e22e;">:body</span> parse/spread call-exp<span style="color: #797979;">]</span><span style="color: #696969;">))</span>

<span style="color: #696969;">(</span><span style="color: #f92672; font-weight: bold;">+jojo</span> parse/spread <span style="color: #B380A8;">{</span>parse<span style="color: #B380A8;">}</span> list-map list-spread<span style="color: #696969;">)</span>
</pre>
</div>
</div>
</div>
